#a = 25
#b = 5
#if a == b**2:
#    print("a = b*b")
#else:
#    print("a != b*b")

# Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
# a = 25
# b = 5
# c = 31
# d = 24
# e = 25
# max = a
# for i in b, c, d, e:
#     if max < i:
#         max = i
    
# print(f"max = {max}")

# Вывести на экран числа от -N до N
# n = 5
# for i in range(-n,n+1):
#     print(f" число - {i}")

# Показать первую цифру дробной части числа
# n = 13.14
# d = int((n*10) % 10 )
# print(d)

# Дано число. Проверить кратно ли оно 5 и 10 или 15 но не 30
# n = 30
# if ((n % 5 == 0) and  (n % 10 == 0)) or ((n % 15 == 0) and  (n % 30 != 0)):
#     print(f"{n} - Удовлетворяет условиям")
# else:
#     print(f"{n} - Не довлетворяет условиям")


# Дано число обозначающее день недели. Вывести его название и указать является ли он выходным.
# n = 1
# days = ("mon", "thu", "wen", "thus", "fri", "sat", "sun")
# print(days[n-1])
# if ( n == 6 ) or ( n == 7 ):
#     print(" - выходной !!!")
 
#Проверить истинность утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат предикат

#Сообщить в какой четверти координатной плоскости или на какой оси находится точка с координатами Х и У 
# x = 0
# y = 0
# if (x > 0) and (y > 0):
#     print("Четверть 1")
# elif (x < 0) and (y > 0):
#     print("Четверть 4")
# elif (x < 0) and (y < 0):
#     print("Четверть 3")
# elif (x < 0) and (y > 0):
#     print("Четверть 2")
# elif (x == 0) or (y == 0):
#     print("Точка лежит на оси")

# ???? print([['1', '2'], ['3', '4']][b < 0][a < 0])




#Указав номер четверти прямоугольной системы координат, показать допустимые значения координат для точек этой четверти

#Найти расстояние между двумя точками пространства
# x1 = -3
# y1 = 4
# x2 = 5
# y2 = 7
# res = ((x1 - x2)**2 + (y1 - y2)**2)**0.5
# print(res)

# x = [1,2,3]
# print(type(x))



# Сформировать список из  N членов последовательности.
# Для N = 5: 1, -3, 9, -27, 81 и т.д.


# Пользователь задаёт две строки. Определить количество вхождений одной строки в другой.

# Написать программу получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда
# [ 1, 2, 6, 24 ]
# Подсчитать сумму цифр в вещественном числе.
